In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [6]:
import numpy as np

In [7]:
data=Series(np.array(np.arange(1,6)))

In [8]:
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
liste=list(data)

In [10]:
liste

[1, 2, 3, 4, 5]

In [11]:
s1=Series([2, 4, 6, 8, 10])

In [12]:
s2=Series( [1, 3, 5, 7, 9])

In [14]:
som=s1.add(s2)

In [15]:
som

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [19]:
multi=s1.mul(s2)

In [20]:
multi

0     2
1    12
2    30
3    56
4    90
dtype: int64

In [21]:
divi=s1.div(s2)

In [22]:
divi

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [23]:
sub=s1.sub(s2)

In [24]:
sub

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [27]:
s3=Series([2, 4, 6, 8, 10])

In [28]:
s4=Series([1, 3, 5, 7, 10])

In [29]:
s3>s4

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [30]:
s3==s2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [31]:
dic={'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

In [33]:
Series(dic)

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [36]:
arr=[10,20,30,40,50]

In [37]:
np.array(arr)

array([10, 20, 30, 40, 50])

In [38]:
s3

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [39]:
s3.astype('ff8')

TypeError: data type 'ff8' not understood

In [40]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])

In [41]:
s1

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [46]:
s1.astype(np.float64)

ValueError: could not convert string to float: 'python'

In [52]:
s1

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [54]:
s1.to_numeric()

AttributeError: 'Series' object has no attribute 'to_numeric'

In [56]:
pd.to_numeric(s1,errors='coerce')

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [59]:
sa=Series(['Red', 'Green', 'White'])

In [60]:
sb=Series(['Red', 'Black]'])

In [61]:
sc=Series(['Yellow'])

In [65]:
sd=sa.append(sb).append(sc)

/tmp/ipykernel_4311/416876091.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sd=sa.append(sb).append(sc)

In [66]:
sd

0       Red
1     Green
2     White
0       Red
1    Black]
0    Yellow
dtype: object

In [69]:
sd=Series([sa+sb+sc])

In [70]:
sd

0    0    RedRedYellow
1             NaN
2         ...
dtype: object

In [71]:
sr=Series([0,100,1, 200,2,'python',3, 300.12,4, 400])

In [72]:
sr

0         0
1       100
2         1
3       200
4         2
5    python
6         3
7    300.12
8         4
9       400
dtype: object

In [76]:
sr.sort_values()

TypeError: '<' not supported between instances of 'str' and 'int'

In [77]:
sr=Series(np.arange(11))

In [78]:
sr

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [79]:
substr=sr[:6]

In [80]:
substr

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [81]:
s1=Series(np.arange(5))

In [82]:
s2=Series((2,4,6,8,10))

In [87]:
s=s1[s1 in s2.values()]

TypeError: 'numpy.ndarray' object is not callable

In [88]:
s=s1[s1 isin s2]

SyntaxError: invalid syntax (1768798062.py, line 1)

In [89]:
s=s1[s1.isin(s2)]

In [90]:
s

2    2
4    4
dtype: int64

In [91]:
s=s1[~s1.isin(s2)]

In [92]:
s

0    0
1    1
3    3
dtype: int64

In [94]:
s=s1[~s1==s2]

In [95]:
s

Series([], dtype: int64)

In [97]:
data={'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [98]:
data

{'X': [78, 85, 96, 80, 86],
 'Y': [84, 94, 89, 83, 86],
 'Z': [86, 97, 96, 72, 83]}

In [99]:
data=DataFrame(data)

In [100]:
data

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [101]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [102]:
exam_data

{'name': ['Anastasia',
  'Dima',
  'Katherine',
  'James',
  'Emily',
  'Michael',
  'Matthew',
  'Laura',
  'Kevin',
  'Jonas'],
 'score': [12.5, 9, 16.5, nan, 9, 20, 14.5, nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [103]:
exam_data=DataFrame(exam_data)

In [104]:
exam_data

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [106]:
exam_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [110]:
exam_data

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [111]:
exam_data.iloc[2]

name        Katherine
score            16.5
attempts            2
qualify           yes
Name: 2, dtype: object

In [114]:
exam_data.loc[:,['name','score']]

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

In [115]:
exam_data.loc[[1,3,5,6],['name','score']]

      name  score
1     Dima    9.0
3    James    NaN
5  Michael   20.0
6  Matthew   14.5

In [118]:
exam_data[exam_data>2]

TypeError: '>' not supported between instances of 'str' and 'int'

In [119]:
exam_data

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [121]:
exam_data[exam_data.attempts>2]

      name  score  attempts qualify
1     Dima    9.0         3      no
3    James    NaN         3      no
5  Michael   20.0         3     yes

In [126]:
exam_data.count(axis=0)

name        10
score        8
attempts    10
qualify     10
dtype: int64

In [130]:
exam_data.axes[1]

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [131]:
len(exam_data.axes[0])

10

In [132]:
len(exam_data.axes[1])

4

In [138]:
exam_data[exam_data.score.isnull()]

    name  score  attempts qualify
3  James    NaN         3      no
7  Laura    NaN         1      no

In [139]:
df=exam_data

In [140]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [147]:
df[(df.score>=15) & (df.score<=20)]

        name  score  attempts qualify
2  Katherine   16.5         2     yes
5    Michael   20.0         3     yes
9      Jonas   19.0         1     yes

In [148]:
df[(df.attempts<2) & (df.score>15)]

    name  score  attempts qualify
9  Jonas   19.0         1     yes

In [149]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [160]:
dfa= {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [161]:
df=DataFrame(dfa)

In [164]:
df=DatatFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

NameError: name 'DatatFrame' is not defined

In [166]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
indix= ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [170]:
df=DataFrame(exam_data,index= ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [171]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [175]:
df.loc[['d'],['score']]=11.5

In [176]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [177]:
df.groupby('attempts').sum()

          score
attempts
1          46.0
2          33.5
3          40.5

In [178]:
df.attempts.sum()

19

In [181]:
df.loc[[:]].mean()

SyntaxError: invalid syntax (116042751.py, line 1)

In [183]:
df.score.mean()

13.333333333333334

In [185]:
k=Series(["Suresh",15.5, 1, "yes"],index=["k"])

ValueError: Length of values (4) does not match length of index (1)

In [187]:
df.loc['k']=["Suresh",15.5, 1, "yes"]

In [188]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [189]:
df.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [191]:
df.sort_values(by=['name','score'],ascending=[False,True])

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [214]:
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})

In [216]:
df

    name  score attempts qualify quality
a   True   True     True     NaN     NaN
b  False  False    False     NaN     NaN
c   True   True     True     NaN     NaN
d  False  False    False     NaN     NaN
e  False  False    False     NaN     NaN
f   True   True     True     NaN     NaN
g   True   True     True     NaN     NaN
h  False  False    False     NaN     NaN
i  False  False    False     NaN     NaN
j   True   True     True     NaN     NaN
k   True   True     True     NaN     NaN

In [ ]:
df['name'] = df['name'].map({'yes': True, 'no': False})